docs/documentation/library/data/list.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-29 Tue 15:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modulus Libraries: list</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../../../modulus-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Modulus Libraries: list</h1>
<div style="text-align:right">
<p>
<a href="../../../index.html">Modulus</a> / <a href="../../index.html">Documentation</a> / <a href="../index.html">Library</a> / <a href="index.html">Data Structures</a> / List
</p>
</div>

<div id="outline-container-org8c52c18" class="outline-2">
<h2 id="org8c52c18">Overview</h2>
</div>
<div id="outline-container-org315d3ff" class="outline-2">
<h2 id="org315d3ff">Outline</h2>
<div class="outline-text-2" id="text-org315d3ff">
<ul class="org-ul">
<li><code>list</code>
<ul class="org-ul">
<li><code>List [A]</code>
<ul class="org-ul">
<li><code>cons</code></li>
<li><code>nil</code></li>
</ul></li>
<li><code>list-monad</code></li>
<li><code>list-seq</code></li>
<li><code>list-monoid</code></li>
<li><code>list-operators</code></li>
</ul></li>
</ul>
</div>
</div>



<div id="outline-container-orgdc8af93" class="outline-2">
<h2 id="orgdc8af93">List Seq</h2>
<div class="outline-text-2" id="text-orgdc8af93">
<p>
Implementation of the [Seq] signature for lists. [Seq] is a generalization
[Container] for data-structures where the elements have some kind of ordering.
</p>
</div>

<div id="outline-container-org1a876f4" class="outline-3">
<h3 id="org1a876f4">Monad</h3>
<div class="outline-text-3" id="text-org1a876f4">
</div>
<div id="outline-container-org82edbc6" class="outline-4">
<h4 id="org82edbc6">Functor</h4>
<div class="outline-text-4" id="text-org82edbc6">
<p>
map
</p>
</div>
</div>

<div id="outline-container-org90ecf71" class="outline-4">
<h4 id="org90ecf71">Applicative</h4>
<div class="outline-text-4" id="text-org90ecf71">
<p>
map
</p>
</div>
</div>

<div id="outline-container-org9497050" class="outline-4">
<h4 id="org9497050">Monad</h4>
<div class="outline-text-4" id="text-org9497050">
<p>
join
</p>

<p>
bind
</p>
</div>
</div>
</div>

<div id="outline-container-orgb44275a" class="outline-3">
<h3 id="orgb44275a">Monoid</h3>
<div class="outline-text-3" id="text-orgb44275a">
</div>
<div id="outline-container-org51516ad" class="outline-4">
<h4 id="org51516ad">Magma</h4>
<div class="outline-text-4" id="text-org51516ad">
<p>
<b>append/⋅</b>
</p>
</div>
</div>

<div id="outline-container-org307795e" class="outline-4">
<h4 id="org307795e">Semigroup</h4>
<div class="outline-text-4" id="text-org307795e">
<p>
<b>append/⋅</b>
</p>
</div>
</div>

<div id="outline-container-orgfec038b" class="outline-4">
<h4 id="orgfec038b">Monoid</h4>
<div class="outline-text-4" id="text-orgfec038b">
<p>
<b>empty/⦗⦘</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org504fa85" class="outline-3">
<h3 id="org504fa85">Seq</h3>
<div class="outline-text-3" id="text-org504fa85">
<p>
<b>insert</b>
</p>

<p>
<b>find</b>
</p>

<p>
<b>fold</b>
</p>

<p>
<b>scan</b>
</p>

<p>
<b>index</b>
</p>

<p>
<b>outer product</b>
</p>

<p>
<b>inner product</b>
</p>

<p>
<b>filter</b>
</p>

<p>
<b>stencil/mask</b>
</p>

<p>
<b>join</b>
</p>

<p>
<b>take</b>
</p>

<p>
<b>drop</b>
</p>
</div>
</div>
</div>


<div id="outline-container-org7f4cd31" class="outline-2">
<h2 id="org7f4cd31">List Monoid</h2>
<div class="outline-text-2" id="text-org7f4cd31">
<p>
Implementation of the [monoid] signature for lists. Note that [monoid] is a
supertype of [groupoid] and [magma]. 
</p>

<p>
<b>Append, ⋅</b>. <code>append x y</code>  
</p>

<p>
<b>empty, ⦗⦘</b> 
</p>
</div>
</div>

<div id="outline-container-org8b7728d" class="outline-2">
<h2 id="org8b7728d">List Operators</h2>
<div class="outline-text-2" id="text-org8b7728d">
<pre class="example">

</pre>
</div>
</div>
</div>
</body>
</html>
